Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/reference.tmx
Source language: en
Languages: pl

source: Compound statements
pl: Wyrażenia złożone

source: Compound statements contain (groups of) other statements; they affect or control the execution of those other statements in some way. In general, compound statements span multiple lines, although in simple incarnations a whole compound statement may be contained in one line.
pl: Instrukcje złożone zawierają (grupy) innych instrukcji; Wpływają lub kontrolują wykonanie tych innych instrukcji w pewien sposób. Na ogół, instrukcje złożone zajmują kilka linii, ale w zwykłej postaci cała instrukcja złożona może być zawarta w jednej linii.

source: The :keyword:`if`, :keyword:`while` and :keyword:`for` statements implement traditional control flow constructs. :keyword:`try` specifies exception handlers and/or cleanup code for a group of statements, while the :keyword:`with` statement allows the execution of initialization and finalization code around a block of code. Function and class definitions are also syntactically compound statements.
pl: Instrukcje :keyword:`if`, :keyword:`while` i :keyword:`for` realizują tradycyjne konstrukcje kontroli przepływu wykonania. Instrukcja :keyword:`try` określa procedury obsługi wyjątków i/lub kod sprzątania dla grupy instrukcji, podczas gdy instrukcja :keyword:`with` umożliwia wykonanie inicjalizacji i sprzątania wokół bloku kodu. Definicje funkcji i klas są również składniowo złożonymi instrukcjami.

source: Compound statements consist of one or more 'clauses.' A clause consists of a header and a 'suite.' The clause headers of a particular compound statement are all at the same indentation level. Each clause header begins with a uniquely identifying keyword and ends with a colon. A suite is a group of statements controlled by a clause. A suite can be one or more semicolon-separated simple statements on the same line as the header, following the header's colon, or it can be one or more indented statements on subsequent lines. Only the latter form of suite can contain nested compound statements; the following is illegal, mostly because it wouldn't be clear to which :keyword:`if` clause a following :keyword:`else` clause would belong::
pl: Instrukcje złożone składają się z jednej lub więcej 'klauzul.' Klauzula składa się z nagłówka i 'bloku instrukcji.' Nagłówki klauzuli konkretnej instrukcji złożonej występują wszystkie na tym samym poziomie wcięcia tekstu. Każdy nagłówek klauzuli zaczyna się od jednoznacznie identyfikującego słowa kluczowego i kończy się dwukropkiem. Blok instrukcji jest grupą Instrukcji kontrolowanych przez klauzulę. Blok instrukcji może być jedną lub więcej rozdzieloną średnikami prostą instrukcją w tej samej linii, co nagłówek, po dwukropku kończącym nagłówek, lub może być jedną lub więcej wciętą instrukcją w kolejnych wierszach. Tylko ten ostatni rodzaj bloku instrukcji może zawierać zagnieżdżone instrukcje złożone; Poniższy przykład jest nieuprawniony, głównie dlatego, że nie byłoby wiadomo, do której klauzuli :keyword:`if` następująca klauzula :keyword:`else` należałaby::

source: Also note that the semicolon binds tighter than the colon in this context, so that in the following example, either all or none of the :func:`print` calls are executed::
pl: Należy również pamiętać, że średnik wiąże mocniej niż dwukropek w tym kontekście, tak że w poniższym przykładzie, albo wszystkie, albo żadne z wywołań :func:`print` nie są realizowane::

source: Summarizing:
pl: Podsumowując:

source: Note that statements always end in a ``NEWLINE`` possibly followed by a ``DEDENT``. Also note that optional continuation clauses always begin with a keyword that cannot start a statement, thus there are no ambiguities (the 'dangling :keyword:`else`' problem is solved in Python by requiring nested :keyword:`if` statements to be indented).
pl: Należy pamiętać, że instrukcje zawsze kończą się znakiem ``NOWEGO WIERSZA`` po którym następuje ewentualnie ``ZNAK COFNIĘCIA WCIĘCIA``. Należy również pamiętać, że opcjonalne klauzule kontynuacji zawsze rozpoczynają się od słowa kluczowego, które nie może rozpoczynać instrukcji, więc nie ma żadnych niejasności (problem 'wiszącej klauzuli :keyword:`else`' w Pythonie jest rozwiązany przez wymaganie, aby zagnieżdżone instrukcje :keyword:`if` były wcięte).

source: The formatting of the grammar rules in the following sections places each clause on a separate line for clarity.
pl: Formatowanie reguł gramatycznych w następujących sekcjach umieszcza każdą klauzulę w osobnej linii dla jasności.

source: The :keyword:`if` statement
pl: Instrukcja `jeżeli` ( - z ang. -:keyword:`if`)

source: The :keyword:`if` statement is used for conditional execution:
pl: Instrukcja jeżeli ( - z ang. - :keyword:`if`) służy warunkowemu wykonaniu:

source: It selects exactly one of the suites by evaluating the expressions one by one until one is found to be true (see section :ref:`booleans` for the definition of true and false); then that suite is executed (and no other part of the :keyword:`if` statement is executed or evaluated). If all expressions are false, the suite of the :keyword:`else` clause, if present, is executed.
pl: Wybiera dokładnie jeden z bloków instrukcji przez obliczenie wyrażeń kolejno, aż do znalezienia zwracającego prawdę (sięgnij do sekcji `wartości logicznych` ( - z ang. - :ref:`booleans`) po definicję wartości logicznych prawdy i fałszu); a następnie ten zestaw instrukcji jest wykonywany (i żadna inna część instrukcji `jeżeli` ( - z ang. - :keyword:`if`) nie jest wykonywana ani obliczana). Jeżeli wszystkie wyrażenia zwracają wartość fałszu ( - z ang. - false), zestaw instrukcji klauzuli `przeciwnego przypadku` ( - z ang. -:keyword:`else`) - jeżeli występuje - jest wykonywany.

source: The :keyword:`while` statement
pl: Instrukcja `dopóki` ( - z ang. - :keyword:`while`)

source: The :keyword:`while` statement is used for repeated execution as long as an expression is true:
pl: Instrukcja `dopóki` ( - z ang. - :keyword:`while`) służy do wielokrotnego wykonania, dopóki wyrażenie jest prawdziwe:

source: This repeatedly tests the expression and, if it is true, executes the first suite; if the expression is false (which may be the first time it is tested) the suite of the :keyword:`else` clause, if present, is executed and the loop terminates.
pl: Wielokrotnie sprawdza wyrażenie i, jeśli wynikiem jest prawda, wykonuje pierwszy zestaw instrukcji; jeśli wyrażenie zwraca fałsz (co może nawet być przy pierwszym sprawdzeniu) zestaw instrukcji klauzuli `przeciwnego przypadku` ( - z ang. - :keyword:`else`) - jeżeli występuje - jest wykonywany i pętla kończy się.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and goes back to testing the expression.
pl: Polecenie `przerwij` ( - z ang. - :keyword:`break`) wykonane w pierwszym zestawie instrukcji, bez wykonywania zestawu instrukcji klauzuli `przeciwnego przypadku` ( - z ang. - :keyword:`else`) kończy pętlę. Instrukcja `dalszego ciągu` ( - z ang. - :keyword:`continue`) wykonywana w pierwszym zestawie instrukcji pomija resztę zestawu instrukcji i wraca do badania wyrażenia warunkowego.

source: The :keyword:`for` statement
pl: Instrukcja powtarzania `dla` ( - z ang. - :keyword:`for`)

source: The :keyword:`for` statement is used to iterate over the elements of a sequence (such as a string, tuple or list) or other iterable object:
pl: Instrukcja `dla` ( - z ang. - :keyword:`for`) służy do przeglądania elementów sekwencji (np. ciągu, krotki lub listy) lub innych obiektów możliwych do przeglądania:

source: The expression list is evaluated once; it should yield an iterable object. An iterator is created for the result of the ``expression_list``. The suite is then executed once for each item provided by the iterator, in the order of ascending indices. Each item in turn is assigned to the target list using the standard rules for assignments (see :ref:`assignment`), and then the suite is executed. When the items are exhausted (which is immediately when the sequence is empty or an iterator raises a :exc:`StopIteration` exception), the suite in the :keyword:`else` clause, if present, is executed, and the loop terminates.
pl: Wyrażenie listy jest obliczana raz; powinno zwracać obiekt możliwy do przeglądania. Tworzony jest obiekt przechodzący dla wyniku ``wyrażenia_listy``. Wtedy wykonywany jest podprogram zagnieżdżony pętli `dla`, raz dla każdego elementu dostarczonego przez obiekt przechodzący, w kolejności uporządkowanej rosnąco. Każdy taki element dostarczony przez obiekt przechodzący jest przypisywany do docelowej listy używając reguł przypisań (sięgnij do sekcji :ref:`przypisań` - z ang. - :ref:`assignment`), i wtedy wykonywany jest zestaw instrukcji zagnieżdżonych. Gdy wszystkie elementy zostaną przejrzane (co następuje natychmiast, gdy sekwencja staje się pusta, lub obiekt przeglądający zgłosi sytuację wyjątkową `zakończenia powtórzeń` - z ang. - :exc:`StopIteration`), wtedy zestaw instrukcji w klauzuli `sytuacji wyjątkowej` - z ang. -:keyword:`else` - jeśli występuje - jest wykonywany, i ciąg powtórzeń kończy się.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and continues with the next item, or with the :keyword:`else` clause if there was no next item.
pl: Instrukcja :keyword:`break` wykonywana w głównym bloku instrukcji pętli for, bez wykonania bloku dla klauzuli :keyword:`else` kończy pętlę. Instrukcja :keyword:`continue` wykonana w głównym bloku instrukcji, pomija resztę bloku i kontynuuje wykonanie pętli dla następnego elementu, jeśli jest następny element, lub wykonuje polecenia bloku dla klauzuli :keyword:`else` w przeciwnym wypadku.

source: The suite may assign to the variable(s) in the target list; this does not affect the next item assigned to it.
pl: W zagnieżdżonym bloku można zmieniać wartości zmiennej(ych) z listy elementów pętli for; nie ma to wpływu na następną wartość przypisaną do zmiennej przechodzącej po elementach listy.

source: Names in the target list are not deleted when the loop is finished, but if the sequence is empty, it will not have been assigned to at all by the loop. Hint: the built-in function :func:`range` returns an iterator of integers suitable to emulate the effect of Pascal's ``for i := a to b do``; e.g., ``list(range(3))`` returns the list ``[0, 1, 2]``.
pl: Nazwy z listy końcowej nie są kasowane, gdy pętla się kończy, ale jeśli lista jest pusta, to nie były one w ogóle przypisane przez pętlę. Porada: wbudowana funkcja zakres ( - z ang. - :func:`range`) zwraca obiekt przechodzący po liście liczb całkowitych, który można wykorzystać do osiągnięcia rezultatu znanego z Pascala ``for i := a to b do``; np., ``list(range(3))`` zwraca listę ``[0, 1, 2]``.

source: There is a subtlety when the sequence is being modified by the loop (this can only occur for mutable sequences, i.e. lists). An internal counter is used to keep track of which item is used next, and this is incremented on each iteration. When this counter has reached the length of the sequence the loop terminates. This means that if the suite deletes the current (or a previous) item from the sequence, the next item will be skipped (since it gets the index of the current item which has already been treated). Likewise, if the suite inserts an item in the sequence before the current item, the current item will be treated again the next time through the loop. This can lead to nasty bugs that can be avoided by making a temporary copy using a slice of the whole sequence, e.g., ::
pl: Istnieje pewna subtelność, gdy sekwencja która jest przeglądana w pętli jest modyfikowana przez tę pętlę (może to nastąpić tylko dla modyfikowalnych sekwencji, czyli dla list). Aby śledzić, który element jest używany jako następny, używany jest wewnętrzny licznik, i jest on zwiększany o jeden dla każdego przejścia. Gdy licznik osiąga wartość równą długości sekwencji, pętla jest kończona. To oznacza, że jeśli blok instrukcji zagnieżdżony w pętli skasuje obecny (lub poprzedni) element w sekwencji, następny element zostanie pominięty (gdyż pętla otrzyma numer porządkowy obecnego elementu, który był już obsługiwany). Podobnie, jeśli zagnieżdżony w pętli blok instrukcji wstawi element do sekwencji przed obecnym elementem, obecny element zostanie przetworzony raz jeszcze przy następnym obrocie pętli. To może prowadzić do nieciekawych błędów, których można uniknąć tworząc kopię tymczasową przy użyciu wycinka całej sekwencji, np. ::

source: The :keyword:`try` statement
pl: Instrukcja `spróbuj` - ang. - :keyword:`try`

source: The :keyword:`try` statement specifies exception handlers and/or cleanup code for a group of statements:
pl: Instrukcja `spróbuj` ( - z ang. -:keyword:`try`) określa sytuacje wyjątkowe i/lub program opróżniający pamięć dla zwartego zbioru instrukcji:

source: The :keyword:`except` clause(s) specify one or more exception handlers. When no exception occurs in the :keyword:`try` clause, no exception handler is executed. When an exception occurs in the :keyword:`try` suite, a search for an exception handler is started. This search inspects the except clauses in turn until one is found that matches the exception. An expression-less except clause, if present, must be last; it matches any exception. For an except clause with an expression, that expression is evaluated, and the clause matches the exception if the resulting object is "compatible" with the exception. An object is compatible with an exception if it is the class or a base class of the exception object or a tuple containing an item compatible with the exception.
pl: Klauzula(e) `z wyjątkiem` ( - z ang. - :keyword:`except`) określa obsługę jednego lub więcej wyjątków. Gdy żaden wyjątek nie jest zgłaszany w klauzuli `spróbuj ( - z ang. - :keyword:`try`), żaden z podprogramów obsługi wyjątku nie jest wykonywany. Gdy wyjątek wystąpi w zagnieżdżonym bloku instrukcji klauzuli `spróbuj` ( - z ang. - :keyword:`try`), rozpoczynane jest poszukiwanie klauzuli obsługującej ten wyjątek. Przeszukiwane są wszystkie klauzule wyjątków po kolei, aż napotkana zostanie odpowiadająca danemu wyjątkowi. Klauzula `z wyjątkiem` ( - z ang. - :keyword:`except`), która nie określa wyjątku, jeśli ma się pojawić, powinna być ostatnia; określa ona dowolny wyjątek. Dla klauzuli `z wyjątkiem` ( - z ang. - :keyword:`except`) z wyrażeniem określającym wyjątek, te wyrażenie jest obliczane, i klauzula odpowiada wyjątkowi, jeśli rodzaj wynikającego obiektu jest "zgodny" z rodzajem wyjątku. Rodzaj obiektu jest zgodny z rodzajem wyjątku jeśli należy do klasy, lub klasy bazowej, obiektu wyjątku lub krotki zawierającej element zgodny z wyjątkiem.

source: If no except clause matches the exception, the search for an exception handler continues in the surrounding code and on the invocation stack. [#]_
pl: Jeśli żadna klauzula wyjątku nie pasuje do zgłoszonego wyjątku, poszukiwanie obsługi wyjątku kontynuowane jest w podprogramie otaczającym i na stercie wywołań. [#]_

source: If the evaluation of an expression in the header of an except clause raises an exception, the original search for a handler is canceled and a search starts for the new exception in the surrounding code and on the call stack (it is treated as if the entire :keyword:`try` statement raised the exception).
pl: Jeśli samo obliczenie wyrażenia w nagłówku klauzuli `z wyjątkiem` ( - z ang. - `except`) zwróci wyjątek, wtedy poszukiwanie wyjątku zostanie przerwane i poszukiwanie rozpocznie się dla nowego wyjątku w otaczającym podprogramie i na stercie wywołań (jest to traktowane tak, jakby cała instrukcja `spróbuj` ( - z ang.-:keyword:`try`) zgłosiła wyjątek).

source: When a matching except clause is found, the exception is assigned to the target specified after the :keyword:`as` keyword in that except clause, if present, and the except clause's suite is executed. All except clauses must have an executable block. When the end of this block is reached, execution continues normally after the entire try statement. (This means that if two nested handlers exist for the same exception, and the exception occurs in the try clause of the inner handler, the outer handler will not handle the exception.)
pl: Gdy pasująca klauzula except zostanie znaleziona, wyjątek jest przypisywany do celu określonego po słowie kluczowym :keyword:`as` w tej klauzuli wyjątku, jeśli jest obecna i blok klauzuli except jest wykonywany. Wszystkie klauzule except muszą mieć blok wykonywalny. Kiedy zostanie osiągnięty koniec tego bloku, wykonanie jest kontynuowane zwyczajnie po całej instrukcji try. (To znaczy, że jeżeli istnieją dwa zagnieżdżone bloki obsługi tego samego wyjątku i wyjątek występuje w klauzuli try wewnętrznej procedury obsługi, zewnętrzna procedura obsługi nie obsłuży wyjątku.)

source: When an exception has been assigned using ``as target``, it is cleared at the end of the except clause. This is as if ::
pl: Gdy wyjątek przypisano przy użyciu ``jako cel``, jest on kasowany na końcu klauzuli wyjątku. To jest tak, jakby ::

source: was translated to ::
pl: zostało przetłumaczone na ::

source: This means the exception must be assigned to a different name to be able to refer to it after the except clause. Exceptions are cleared because with the traceback attached to them, they form a reference cycle with the stack frame, keeping all locals in that frame alive until the next garbage collection occurs.
pl: Oznacza to, że wyjątek musi być przypisany do innej nazwy, aby móc się do niego odwołać po klauzuli wyjątku. Wyjątki są usuwane, ponieważ z informacjami o stosie dołączonymi do nich, tworzą one cykl odniesień z ramką stosu, z zachowaniem wszystkich zmiennych lokalnych, zmiennych w tej ramce aż do wystąpienia następnego odśmiecania.

source: Before an except clause's suite is executed, details about the exception are stored in the :mod:`sys` module and can be access via :func:`sys.exc_info`. :func:`sys.exc_info` returns a 3-tuple consisting of: ``exc_type``, the exception class; ``exc_value``, the exception instance; ``exc_traceback``, a traceback object (see section :ref:`types`) identifying the point in the program where the exception occurred. :func:`sys.exc_info` values are restored to their previous values (before the call) when returning from a function that handled an exception.
pl: Przed wykonaniem bloku instrukcji klauzuli except szczegóły dotyczące wyjątku są przechowywane w module :mod​​:`sys` i mogą być dostępne przez funkcję :func:`sys.exc_info`. Funkcja :func:`sys.exc_info` zwraca 3-krotkę składającą się z: ``exc_type``, klasy wyjątku; ``exc_value``, instancji wyjątku; ``exc_traceback``, obiektu śladu błędu (zob. sekcję :ref:`types`) identyfikujące punkt w programie, w którym wystąpił wyjątek. Wartości :func:`sys.exc_info` są przywracane do poprzednich (sprzed wywołania) po powrocie z funkcji, która obsłużyła wyjątek.

source: The optional :keyword:`else` clause is executed if and when control flows off the end of the :keyword:`try` clause. [#]_ Exceptions in the :keyword:`else` clause are not handled by the preceding :keyword:`except` clauses.
pl: Nieobowiązkowa klauzula :keyword:`else` wykonywana jest wtedy, gdy poza koniec klauzuli :keyword:`try` sterowanie jest przekazywane. [#]_ Wyjątki w klauzuli :keyword:`else` nie są obsługiwane przez klauzule :keyword:`except` odnoszące się do pierwotnie otaczanego bloku kodu.

source: If :keyword:`finally` is present, it specifies a 'cleanup' handler. The :keyword:`try` clause is executed, including any :keyword:`except` and :keyword:`else` clauses. If an exception occurs in any of the clauses and is not handled, the exception is temporarily saved. The :keyword:`finally` clause is executed. If there is a saved exception, it is re-raised at the end of the :keyword:`finally` clause. If the :keyword:`finally` clause raises another exception or executes a :keyword:`return` or :keyword:`break` statement, the saved exception is lost. The exception information is not available to the program during execution of the :keyword:`finally` clause.
pl: Jeżeli słowo kluczowe :keyword:`finally` jest obecne, wtedy określa ono 'porządkującą' proceduję obsługi. Klauzula :keyword:`try` włącznie z wszelkimi klauzulami :keyword:`except` oraz :keyword:`else` jest wykonywana. Jeśli wyjątek wystąpi w dowolnej z klauzul i nie zostanie obsłużony, wyjątek zostaje tymczasowo zapamiętany. Klauzula :keyword:`finally` jest wykonywana. Jeśli istnieje zapisany wcześniej wyjątek, to ponownie po zakończeniu klauzuli :keyword:`finally` jest on zgłaszany. Jeśli klauzula :keyword:`finally` zgłosi inny wyjątek lub któraś z instrukcji :keyword:`return` lub :keyword:`break` zostanie wykonana, to zapisany wyjątek jest tracony. Informacje o wyjątku nie są dostępne w programie, gdy klauzula :keyword:`finally` jest wykonywana.

source: When a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement is executed in the :keyword:`try` suite of a :keyword:`try`...\ :keyword:`finally` statement, the :keyword:`finally` clause is also executed 'on the way out.' A :keyword:`continue` statement is illegal in the :keyword:`finally` clause. (The reason is a problem with the current implementation --- this restriction may be lifted in the future).
pl: Kiedy wykonywana jest instrukcja :keyword:`return`, :keyword:`break` lub :keyword:`continue` w bloku kodu :keyword:`try` wewnętrznym dla instrukcji rozpoczętej przez :keyword:`try`...\ :keyword:`finally` zaś zakończonej, klauzula :keyword:`finally` jest wykonywana również 'po drodze do wyjścia.' Polecenie :keyword:`continue` w klauzuli :keyword:`finally` jest niedozwolone. (Powodem jest problem w obecnej implementacji --- to ograniczenie może zostać zniesione w przyszłości).

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information on using the :keyword:`raise` statement to generate exceptions may be found in section :ref:`raise`.
pl: Dodatkowe informacje na temat wyjątków można znaleźć w sekcji :ref:`wyjątki`, a informacje na temat korzystania z instrukcji :keyword:`raise` do generowania wyjątków można znaleźć w sekcji :ref:`raise`.

source: The :keyword:`with` statement
pl: Instrukcja :keyword:`with`

source: The :keyword:`with` statement is used to wrap the execution of a block with methods defined by a context manager (see section :ref:`context-managers`). This allows common :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` usage patterns to be encapsulated for convenient reuse.
pl: Instrukcja :keyword:`with` służy do otaczania wykonania bloku instrukcji w metody określone przez zarządcę kontekstu (zob. sekcję :ref:`zarządcy-kontekstu`). Pozwala to zwykłym sposobom użytkowania :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` na enkapsulację dla wygodnego ponownego wykorzystania.

source: The execution of the :keyword:`with` statement with one "item" proceeds as follows:
pl: Wykonanie instrukcji :keyword:`with` z jednym "elementem" postępuje w sposób następujący:

source: The context expression is evaluated to obtain a context manager.
pl: Wyrażenie jest obliczane w celu uzyskania menedżera kontekstu.

source: The context manager's :meth:`__exit__` is loaded for later use.
pl: Metoda :meth:`__exit__` zarządcy kontekstu jest ładowana do późniejszego wykorzystania.

source: The context manager's :meth:`__enter__` method is invoked.
pl: Metoda :meth:`__enter__` zarządcy kontekstu jest wywoływana.
